models/Region.php

SELECT * FROM `region` WHERE `region_type`=1
---
    public static function getProvices()
    {
        $db = static::find()->where(['region_type' => 1])->all();

SELECT * FROM `region` WHERE `region_parent_id`='0'
---
    public static function getRegionByParent($parentId)
    {
        $db = static::find()->where(['region_parent_id' => $parentId])->all();