models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(["user_id", $id]);
---
SELECT * FROM `user` WHERE `user_id` IN ('user_id', '1')